from random import randint
import json


def norm_form(time):
    return '0' + str(time) if time < 10 else time


def random_house_number():
    return randint(1, 100)


def random_housing_number():
    return randint(1, 10)


def random_flat_number():
    return randint(1, 500)


def get_random_number():
    return randint(100, 401)


def get_random_birthday():
    month = norm_form(randint(1, 12))
    day = norm_form(randint(1, 30) if month != '02' else randint(1, 28))
    return f'{randint(2000, 2005)}-{month}-{day}'


def get_random_exam_date():
    """exams only in June"""
    day = norm_form(randint(1, 30))
    result = f'-06-{day} 10:00:00'
    return result


def get_random_desk_number():
    """let it be 18 (6, 6, 6) tables in each class"""
    return randint(1, 18)


def get_random_passport_series():
    return randint(1000, 9999)


def get_random_passport_number():
    return randint(100000, 999999)


def get_random_date_result(date_exam):
    # '2019-06-15 10:00:00'
    # время прихода результата будет рандомное
    # дата будет больше, чем у date_exam
    year, month, day = str(date_exam).split()[0].split('-')
    month_result = norm_form(randint(6, 7))
    day_result = norm_form(randint(1, 30))
    if month_result == '06' and day == '30':
        month_result = '07'
    elif month_result == '06' and day != '30':
        day_result = norm_form(randint(int(day), 30))

    hours, minutes = norm_form(randint(0, 23)), norm_form(randint(1, 59))
    return f'{year}-{month_result}-{day_result} {hours}:{minutes}:00'


def ger_random_result(subject):
    available_subject_points = AVAILABLE_POINTS[subject]
    if randint(0, 1):
        json_result = {task: randint(randint(1, max_points), max_points) for task, max_points in available_subject_points.items()}
    else:
        json_result = {task: randint(randint(0, max_points), max_points) for task, max_points in available_subject_points.items()}
    sum_primary_score = sum(json_result.values())
    return json.dumps(json_result), sum_primary_score, TRANSFER_OF_POINTS[subject][sum_primary_score]


CITIES = [
    'Москва', 'Санкт-Петербург', 'Новосибирск',
    'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Самара',
]
STREETS = [
    'Центральная', 'Молодежная', 'Школьная', 'Лесная',
    'Садовая', 'Советская', 'Новая', 'Набережная', 'Заречная', 'Зеленая',
    'Ленина', 'Полевая', 'Луговая'
]
HOUSES = random_house_number
HOUSINGS = random_housing_number
FLATS = random_flat_number

FIRST_FEMALE_NAMES = ['Anna', 'Olga', 'Darya', 'Anastasia', 'Kristina', 'Alla', 'Marya', 'Alina']
FIRST_MALE_NAMES = ['Ilia', 'Denis', 'Ivan', 'Peter', 'Anton', 'Vasily', 'Philip', 'Ser', 'Alex']

SECOND_FEMALE_NAMES = ['Lubimova', 'Ivanova', 'Petrova', 'Trofimova', 'Baranova', 'Anisimova', 'Maltseva', 'Pimenova']
SECOND_MALE_NAMES = ['Ivanov', 'Petrov', 'Sidorov', 'Trofimov', 'Lubimov', 'Panin', 'Voronin', 'Maksimov', 'Kireev']

FEMALE_PATRONYMICS = ['Sergeevna', 'Olegovna', 'Alexandrovna', 'Ivanovna', 'Petrovna', 'Denisovna']
MALE_PATRONYMICS = ['Sergeevic', 'Olegovich', 'Alexandrovich', 'Ivanovich', 'Petrovich', 'Denisovich']

BIRTHDAYS = get_random_birthday

PASSPORT_SERIES = get_random_passport_series
PASSPORT_NUMBERS = get_random_passport_number

MOSCOW_SCHOOLS = [
    'Общеобразовательная школа № 1206',
    'Общеобразовательная школа "Школа № 1561"',
    'Средняя общеобразовательная школа № 1095',
    'Общеобразовательная школа "Школа им. Н.М. Карамзина"',
    'Государственное бюджетное общеобразовательное учреждение "Школа № 1532"',
    'Государственное бюджетное общеобразовательное учреждение "Лицей № 1581"',
    'Государственное бюджетное общеобразовательное учреждение "Школа № 1474"',
    'Государственное бюджетное общеобразовательное учреждение "Школа № 1905"',
    'Государственное бюджетное общеобразовательное учреждение "Школа № 1250"',
    'Государственное бюджетное общеобразовательное учреждение "Гимназия № 1577"',
    'Государственное бюджетное общеобразовательное учреждение "Гимназия № 1541"',
    'Государственное бюджетное общеобразовательное учреждение "Лицей информационных технологий № 1537"',
    'Государственное бюджетное общеобразовательное учреждение "Школа № 1151"',
    'Государственное бюджетное общеобразовательное учреждение "Гимназия № 1583 имени К.А. Керимова"',
    'Государственное бюджетное общеобразовательное учреждение "Школа № 72"'
]

NOT_MOSCOW_SCHOOLS = [
    'Муниципальное автономное общеобразовательное учреждение "Школа № 20"',
    'Муниципальное автономное общеобразовательное учреждение "Школа № 17"',
    'Муниципальное автономное общеобразовательное учреждение "Школа № 27"',
    'Муниципальное автономное общеобразовательное учреждение "Школа № 97"',
    'Муниципальное автономное общеобразовательное учреждение "Школа № 78"',
    'Муниципальное автономное общеобразовательное учреждение "Школа № 12"',
    'Муниципальное автономное общеобразовательное учреждение "Школа № 19"',
    'Муниципальное автономное общеобразовательное учреждение "Школа № 13"',
    'Муниципальное автономное общеобразовательное учреждение "Средняя общеобразовательная школа № 88"',
    'Муниципальное автономное общеобразовательное учреждение "Средняя общеобразовательная школа № 28"',
    'Муниципальное автономное общеобразовательное учреждение "Средняя общеобразовательная школа № 68"',
    'Муниципальное автономное общеобразовательное учреждение "Средняя общеобразовательная школа № 89"',
    'Муниципальное автономное общеобразовательное учреждение "Средняя общеобразовательная школа № 78"',
    'Муниципальное автономное общеобразовательное учреждение "Средняя общеобразовательная школа № 72"',
    'Муниципальное автономное общеобразовательное учреждение "Средняя общеобразовательная школа № 9"',
    'Муниципальное автономное общеобразовательное учреждение "Средняя общеобразовательная школа № 34"',
    'Муниципальное автономное общеобразовательное учреждение "Средняя общеобразовательная школа № 2"',
    'Муниципальное бюджетное общеобразовательное учреждение "Гимназия № 63"',
    'Муниципальное бюджетное общеобразовательное учреждение "Гимназия № 10"',
    'Муниципальное автономное общеобразовательное учреждение "Средняя общеобразовательная школа № 59"',
    'Муниципальное бюджетное общеобразовательное учреждение "Средняя общеобразовательная школа № 14"',
    'Муниципальное бюджетное общеобразовательное учреждение "Основная общеобразовательная школа № 21"',
    'Муниципальное бюджетное общеобразовательное учреждение "Лицей № 2"',
    'Муниципальное бюджетное общеобразовательное учреждение "Средняя общеобразовательная школа №37"',
    'Муниципальное бюджетное общеобразовательное учреждение "Основная общеобразовательная школа № 11"',
    'Муниципальное бюджетное общеобразовательное учреждение "Лицей № 1"',
    'Муниципальное казенное общеобразовательное учреждение "Общеобразовательная средняя школа №3"',
    'Муниципальное бюджетное общеобразовательное учреждение "Гимназия № 15"',
    'Муниципальное бюджетное общеобразовательное учреждение "Гимназия № 58"',
    'Муниципальное бюджетное общеобразовательное учреждение "Гимназия № 53"',
    'Муниципальное бюджетное общеобразовательное учреждение "Гимназия № 55"',
    'Муниципальное бюджетное общеобразовательное учреждение "Гимназия № 50"',
    'Муниципальное бюджетное общеобразовательное учреждение "Гимназия № 80"',
    'Муниципальное бюджетное общеобразовательное учреждение "Гимназия № 91"',
    'Муниципальное бюджетное общеобразовательное учреждение "Гимназия № 70"',
    'Муниципальное бюджетное общеобразовательное учреждение "Гимназия №74"',
    'Муниципальное бюджетное общеобразовательное учреждение средняя общеобразовательная школа № 33',
    'Муниципальное общеобразовательное учреждение среднияя общеобразовательная школа №48',
    'Муниципальное бюджетное общеобразовательное учреждение "Средняя школа № 47"',
    'Муниципальное бюджетное общеобразовательное учреждение Ленинская средняя общеобразовательная школа',
    'Муниципальное бюджетное общеобразовательное учреждение "Любавинская средняя общеобразовательная школа"',
]

CLASSROOMS = get_random_number

SUBJECTS = ['Математика', 'Русский язык',
            'Физика', 'Информатика',
            'История', 'География',
            'Биология', 'Английский язык',
            'Химия', 'Литература',
            ]

EXAM_DATES = get_random_exam_date

TRANSFER_OF_POINTS = {
    'Математика': {
        1: 5, 2: 9, 3: 14, 4: 18, 5: 23, 6: 27, 7: 33, 8: 39, 9: 45,
        10: 50, 11: 56, 12: 62, 13: 68, 14: 70, 15: 72, 16: 74, 17: 76, 18: 78, 19: 80,
        20: 82, 21: 84, 22: 86, 23: 88, 24: 90, 25: 92, 26: 94, 27: 96, 28: 98, 29: 99,
        30: 100, 31: 100, 32: 100
    },
    'Русский язык': {
        1: 3, 2: 5, 3: 8, 4: 10, 5: 12, 6: 15, 7: 17, 8: 20, 9: 22, 10: 24,
        11: 26, 12: 28, 13: 30, 14: 32, 15: 34, 16: 36, 17: 38, 18: 39, 19: 40, 20: 41,
        21: 43, 22: 44, 23: 45, 24: 46, 25: 48, 26: 49, 27: 50, 28: 51, 29: 53, 30: 54,
        31: 55, 32: 56, 33: 57, 34: 59, 35: 60, 36: 61, 37: 62, 38: 64, 39: 65, 40: 66,
        41: 67, 42: 69, 43: 70, 44: 71, 45: 72, 46: 73, 47: 76, 48: 78, 49: 80, 50: 82,
        51: 85, 52: 87, 53: 89, 54: 91, 55: 94, 56: 96, 57: 98, 58: 100
    },
    'Физика': {
        1: 4, 2: 8, 3: 10, 4: 14, 5: 17, 6: 20, 7: 23, 8: 27, 9: 30, 10: 33,
        11: 36, 12: 38, 13: 39, 14: 40, 15: 41, 16: 42, 17: 44, 18: 45, 19: 46, 20: 47,
        21: 48, 22: 49, 23: 51, 24: 52, 25: 53, 26: 54, 27: 55, 28: 57, 29: 58, 30: 59,
        31: 60, 32: 61, 33: 62, 34: 64, 35: 66, 36: 68, 37: 70, 38: 72, 39: 74, 40: 76,
        41: 78, 42: 80, 43: 82, 44: 84, 45: 86, 46: 88, 47: 90, 48: 92, 49: 94, 50: 96,
        51: 98, 52: 100
    },
    'Информатика': {
        1: 7, 2: 14, 3: 20, 4: 27, 5: 34, 6: 40, 7: 42, 8: 44, 9: 46, 10: 48,
        11: 50, 12: 51, 13: 53, 14: 55, 15: 57, 16: 59, 17: 61, 18: 62, 19: 64, 20: 66,
        21: 68, 22: 70, 23: 72, 24: 73, 25: 75, 26: 77, 27: 79, 28: 81, 29: 83, 30: 84,
        31: 88, 32: 91, 33: 94, 34: 97, 35: 100
    },
    'История': {
        1: 4, 2: 8, 3: 11, 4: 15, 5: 18, 6: 22, 7: 25, 8: 29, 9: 32, 10: 34,
        11: 35, 12: 36, 13: 37, 14: 38, 15: 40, 16: 41, 17: 42, 18: 43, 19: 44, 20: 45,
        21: 47, 22: 48, 23: 49, 24: 50, 25: 51, 26: 52, 27: 54, 28: 55, 29: 56, 30: 57,
        31: 58, 32: 60, 33: 61, 34: 62, 35: 63, 36: 64, 37: 65, 38: 67, 39: 68, 40: 69,
        41: 70, 42: 71, 43: 72, 44: 75, 45: 77, 46: 79, 47: 82, 48: 84, 49: 86, 50: 89,
        51: 91, 52: 93, 53: 96, 54: 98, 55: 100
    },
    'География': {
        1: 4, 2: 7, 3: 11, 4: 14, 5: 17, 6: 21, 7: 24, 8: 27, 9: 31, 10: 34,
        11: 37, 12: 39, 13: 40, 14: 41, 15: 42, 16: 43, 17: 44, 18: 45, 19: 46, 20: 47,
        21: 49, 22: 50, 23: 51, 24: 52, 25: 53, 26: 54, 27: 55, 28: 56, 29: 57, 30: 58,
        31: 60, 32: 61, 33: 62, 34: 63, 35: 64, 36: 65, 37: 66, 38: 67, 39: 68, 40: 69,
        41: 74, 42: 78, 43: 83, 44: 87, 45: 92, 46: 96, 47: 100
    },
    'Литература': {
        1: 3, 2: 5, 3: 7, 4: 9, 5: 11, 6: 13, 7: 15, 8: 18, 9: 20, 10: 22,
        11: 24, 12: 26, 13: 28, 14: 30, 15: 32, 16: 34, 17: 35, 18: 36, 19: 37, 20: 38,
        21: 40, 22: 41, 23: 42, 24: 43, 25: 44, 26: 45, 27: 47, 28: 48, 29: 49, 30: 50,
        31: 51, 32: 52, 33: 54, 34: 55, 35: 56, 36: 57, 37: 58, 38: 59, 39: 61, 40: 62,
        41: 63, 42: 64, 43: 65, 44: 66, 45: 68, 46: 69, 47: 70, 48: 71, 49: 72, 50: 73,
        51: 77, 52: 80, 53: 84, 54: 87, 55: 90, 56: 94, 57: 97, 58: 100
    },
    'Биология': {
        1: 3, 2: 5, 3: 7, 4: 9, 5: 12, 6: 14, 7: 16, 8: 18, 9: 21, 10: 23,
        11: 25, 12: 27, 13: 30, 14: 32, 15: 34, 16: 36, 17: 38, 18: 39, 19: 40, 20: 42,
        21: 43, 22: 44, 23: 46, 24: 47, 25: 48, 26: 50, 27: 51, 28: 52, 29: 53, 30: 55,
        31: 56, 32: 57, 33: 59, 34: 60, 35: 61, 36: 63, 37: 64, 38: 65, 39: 66, 40: 68,
        41: 69, 42: 70, 43: 72, 44: 73, 45: 74, 46: 76, 47: 77, 48: 78, 49: 79, 50: 82,
        51: 84, 52: 86, 53: 89, 54: 91, 55: 93, 56: 96, 57: 98, 58: 100
    },
    'Химия': {
        1: 3, 2: 6, 3: 9, 4: 12, 5: 14, 6: 17, 7: 20, 8: 23, 9: 25, 10: 28,
        11: 31, 12: 34, 13: 36, 14: 38, 15: 39, 16: 40, 17: 41, 18: 42, 19: 43, 20: 44,
        21: 45, 22: 46, 23: 47, 24: 49, 25: 50, 26: 51, 27: 52, 28: 53, 29: 54, 30: 55,
        31: 56, 32: 57, 33: 58, 34: 59, 35: 60, 36: 61, 37: 62, 38: 63, 39: 64, 40: 65,
        41: 67, 42: 68, 43: 69, 44: 71, 45: 72, 46: 73, 47: 74, 48: 75, 49: 76, 50: 87,
        51: 78, 52: 79, 53: 80, 54: 83, 55: 86, 56: 89, 57: 92, 58: 95, 59: 98, 60: 100
    },
    'Английский язык': {
        points: points for points in range(1, 101)
    }

}

ANNUAL_EXAM_DATA = {

    'Математика':
        [
            ('2019' + EXAM_DATES(), TRANSFER_OF_POINTS['Математика'], 19, 5, 23),
            ('2020' + EXAM_DATES(), TRANSFER_OF_POINTS['Математика'], 19, 5, 23),
            ('2021' + EXAM_DATES(), TRANSFER_OF_POINTS['Математика'], 19, 8, 38),
        ],

    'Русский язык':
        [
            ('2019' + EXAM_DATES(), TRANSFER_OF_POINTS['Русский язык'], 27, 15, 34),
            ('2020' + EXAM_DATES(), TRANSFER_OF_POINTS['Русский язык'], 27, 15, 34),
            ('2021' + EXAM_DATES(), TRANSFER_OF_POINTS['Русский язык'], 27, 19, 40),
        ],

    'Физика':
        [
            ('2019' + EXAM_DATES(), TRANSFER_OF_POINTS['Физика'], 32, 10, 33),
            ('2020' + EXAM_DATES(), TRANSFER_OF_POINTS['Физика'], 32, 10, 33),
            ('2021' + EXAM_DATES(), TRANSFER_OF_POINTS['Физика'], 32, 13, 39),
        ],

    'Информатика':
        [
            ('2019' + EXAM_DATES(), TRANSFER_OF_POINTS['Информатика'], 27, 5, 34),
            ('2020' + EXAM_DATES(), TRANSFER_OF_POINTS['Информатика'], 27, 5, 34),
            ('2021' + EXAM_DATES(), TRANSFER_OF_POINTS['Информатика'], 27, 8, 44),
        ],

    'История':
        [
            ('2019' + EXAM_DATES(), TRANSFER_OF_POINTS['История'], 25, 8, 29),
            ('2020' + EXAM_DATES(), TRANSFER_OF_POINTS['История'], 25, 8, 29),
            ('2021' + EXAM_DATES(), TRANSFER_OF_POINTS['История'], 25, 11, 35),
        ],

    'География':
        [
            ('2019' + EXAM_DATES(), TRANSFER_OF_POINTS['География'], 34, 10, 34),
            ('2020' + EXAM_DATES(), TRANSFER_OF_POINTS['География'], 34, 9, 31),
            ('2021' + EXAM_DATES(), TRANSFER_OF_POINTS['География'], 34, 13, 40),
        ],

    'Литература':
        [
            ('2019' + EXAM_DATES(), TRANSFER_OF_POINTS['Литература'], 17, 14, 30),
            ('2020' + EXAM_DATES(), TRANSFER_OF_POINTS['Литература'], 17, 14, 30),
            ('2021' + EXAM_DATES(), TRANSFER_OF_POINTS['Литература'], 17, 21, 40),
        ],

    'Английский язык':
        [
            ('2019' + EXAM_DATES(), {i: i for i in range(1, 101)}, 100, 22, 22),
            ('2020' + EXAM_DATES(), {i: i for i in range(1, 101)}, 100, 22, 22),
            ('2021' + EXAM_DATES(), {i: i for i in range(1, 101)}, 100, 22, 22),
        ],

    'Биология':
        [
            ('2019' + EXAM_DATES(), TRANSFER_OF_POINTS['Биология'], 28, 15, 34),
            ('2020' + EXAM_DATES(), TRANSFER_OF_POINTS['Биология'], 28, 15, 34),
            ('2021' + EXAM_DATES(), TRANSFER_OF_POINTS['Биология'], 28, 18, 39),
        ],

    'Химия':
        [
            ('2019' + EXAM_DATES(), TRANSFER_OF_POINTS['Химия'], 35, 12, 34),
            ('2020' + EXAM_DATES(), TRANSFER_OF_POINTS['Химия'], 35, 12, 34),
            ('2021' + EXAM_DATES(), TRANSFER_OF_POINTS['Химия'], 35, 15, 39),
        ]
}

DESK_NUMBERS = get_random_desk_number

DAYS_RESULT = get_random_date_result

AVAILABLE_POINTS = {
    'Математика': {
        1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 1, 7: 1, 8: 1, 9: 1, 10: 1, 11: 1, 12: 1,
        13: 2, 14: 2, 15: 2, 16: 3, 17: 3, 18: 4, 19: 4
    },
    'Русский язык': {
        1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 1, 7: 1, 8: 5, 9: 1, 10: 1, 11: 1, 12: 1,
        13: 1, 14: 1, 15: 1, 16: 2, 17: 1, 18: 1, 19: 1, 20: 1, 21: 1, 22: 1, 23: 1, 24: 1, 25: 1, 26: 4, 27: 24
    },
    'Физика': {
        1: 1, 2: 1, 3: 1, 4: 1, 5: 2, 6: 2, 7: 2, 8: 1, 9: 1, 10: 1, 11: 2, 12: 2,
        13: 1, 14: 1, 15: 1, 16: 2, 17: 2, 18: 2, 19: 1, 20: 1, 21: 2, 22: 1, 23: 1, 24: 2, 25: 1, 26: 1, 27: 1,
        28: 3, 29: 3, 30: 3, 31: 3, 32: 3
    },
    'Информатика': {
        1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 1, 7: 1, 8: 1, 9: 1, 10: 1, 11: 1, 12: 1,
        13: 1, 14: 1, 15: 1, 16: 1, 17: 1, 18: 1, 19: 1, 20: 1, 21: 1, 22: 1, 23: 1, 24: 3, 25: 2, 26: 3, 27: 4
    },
    'История': {
        1: 1, 2: 2, 3: 2, 4: 1, 5: 2, 6: 2, 7: 2, 8: 2, 9: 2, 10: 1, 11: 3, 12: 2,
        13: 1, 14: 1, 15: 1, 16: 2, 17: 2, 18: 1, 19: 1, 20: 2, 21: 2, 22: 2, 23: 3, 24: 4, 25: 11
    },
    'География': {
        1: 1, 2: 1, 3: 2, 4: 2, 5: 1, 6: 1, 7: 1, 8: 1, 9: 1, 10: 1, 11: 2, 12: 1,
        13: 1, 14: 2, 15: 2, 16: 1, 17: 1, 18: 2, 19: 1, 20: 1, 21: 1, 22: 1, 23: 1, 24: 1, 25: 1, 26: 1, 27: 1,
        28: 2, 29: 2, 30: 2, 31: 2, 32: 2, 33: 2, 34: 2
    },
    'Английский язык': {
        1: 6, 2: 7, 3: 1, 4: 1, 5: 1, 6: 1, 7: 1, 8: 1, 9: 1, 10: 7, 11: 6, 12: 1,
        13: 1, 14: 1, 15: 1, 16: 1, 17: 1, 18: 1, 19: 1, 20: 1, 21: 1, 22: 1, 23: 1, 24: 1, 25: 1, 26: 1, 27: 1,
        28: 1, 29: 1, 30: 1, 31: 1, 32: 1, 33: 1, 34: 1, 35: 1, 36: 1, 37: 1, 38: 1, 39: 6, 40: 14, 41: 1, 42: 5,
        43: 7, 44: 7
    },
    'Литература': {
        1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 1, 7: 1, 8: 6, 9: 10, 10: 1, 11: 1, 12: 1,
        13: 1, 14: 1, 15: 6, 16: 10, 17: 14
    },
    'Биология': {
        1: 1, 2: 1, 3: 1, 4: 2, 5: 2, 6: 1, 7: 2, 8: 2, 9: 2, 10: 2, 11: 2, 12: 2,
        13: 2, 14: 2, 15: 2, 16: 2, 17: 2, 18: 2, 19: 2,
        20: 2, 21: 2, 22: 2, 23: 3, 24: 3, 25: 3, 26: 3, 27: 3, 28: 3
    },
    'Химия': {
        1: 1, 2: 1, 3: 1, 4: 1, 5: 1, 6: 1, 7: 2, 8: 2, 9: 2, 10: 2, 11: 1, 12: 1,
        13: 1, 14: 1, 15: 1, 16: 2, 17: 2, 18: 2, 19: 1, 20: 1, 21: 1, 22: 2, 23: 2, 24: 2, 25: 2, 26: 1, 27: 1,
        28: 1, 29: 1, 30: 2, 31: 2, 32: 4, 33: 5, 34: 4, 35: 3
    }
}

RANDOM_RESULTS = ger_random_result
